<html>
<head>
<title>OPERATEURS PANDORE</title>
<style>
body { padding: 1em 1em 1em 30px; }
</style>
</head>

<body background="#ffffff"><center>
<table border=0 width=100%>
<tr>
<td align=left width=50%><b><i>PANDORE Version 6</i></b></td>
<td align=right width=50%><b><i>GREYC-IMAGE</i></b></td></tr></table>
</center>
<hr>

<!---------------------------------- -->
<h1>pranksegmentationalgorithmsfromfolders</h1>
<!---------------------------------- -->
<hr noshade size=1 width=100 align=left><br>

Classement d'algorithmes de segmentation &agrave; partir de mesures de dissimilarit&eacute; entre des r&eacute;sultats de segmentation et des segmentations de r&eacute;f&eacute;rence (complet).

<br><br><hr noshade size=1 width=100 align=left><br>

<!---------------------------------- -->
<h3>Synopsis</h3>
<!---------------------------------- -->
<tt>
<b>pranksegmentationalgorithmsfromfolders</b> <i>matching_algorithm_id</i> <i>matching_threshold</i>  <i>acceptable_error1</i> <i>priority1</i> <i>acceptable_error2</i> <i>priority2</i> <i>acceptable_error3</i> <i>priority3</i> <i>acceptable_error4</i> <i>priority4</i> <i>acceptable_error5</i> <i>priority5</i> <i>segmentation_result_path</i> <i>reference_segmentation_path</i> [<i>col_out1</i>|-] [<i>col_out2</i>|-]
</tt>

<!---------------------------------- -->
<h3>Description</h3>
<!---------------------------------- -->
<p>L'op&eacute;rateur <b>pranksegmentationalgorithmsfromfolders</b> permet de classer plusieurs
algorithmes de segmentation d'images selon leurs performances.
Les performances sont &eacute;valu&eacute;es par comparaison des r&eacute;sultats des algorithmes sur
des images test avec des segmentations de r&eacute;f&eacute;rence fournies par des experts.</p>

<p>Les performances sont calcul&eacute;es &agrave; partir de mesures de dissimilarit&eacute;
entre les r&eacute;sultats de segmentation et les segmentations de r&eacute;f&eacute;rence correspondantes.
Cinq indicateurs de dissimilarit&eacute; sont &eacute;valu&eacute;s, et &agrave; chaque fois,
deux mesures sont calcul&eacute;es avec une valeur entre 0 et 1&nbsp:</p>
<ul> 
<li><b>Indicateur 1</b> : La <b>pr&eacute;cision de la d&eacute;tection</b>&nbsp;: Les deux erreurs mesur&eacute;es sont&nbsp;:</li>
<ul>
<li>L'erreur de rappel qui rend compte de la proportion de faux n&eacute;gatifs.</li>
<li>L'erreur de pr&eacute;cision qui rend compte de la proportion de faux positifs.</li>
</ul>
<li><b>Indicateur 2</b> : La <b>coh&eacute;rence de la fragmentation</b>&nbsp;: Les deux erreurs mesur&eacute;es sont&nbsp;: 
<ul>
<li>L'erreur de sous-segmentation qui rend compte de la proportion de r&eacute;gions agglom&eacute;r&eacute;es par segment.
<li>L'erreur de sur-segmentation qui rend compte de la proportion de fragmentation des r&eacute;gions en plusieurs segments.
</ul>
<li><b>Indicateur 3</b> : La <b>localisation des fronti&egrave;res</b>&nbsp;: Les deux erreurs mesur&eacute;es sont&nbsp;: 
<ul>
<li>L'erreur de d&eacute;ficit de pixels qui rend compte de la proportion de pixels non d&eacute;tect&eacute;s dans les r&eacute;gions d&eacute;tect&eacute;es.
<li>L'erreur d'exc&egrave;s de pixels qui rend compte de la proportion de pixels erron&eacute;s ajout&eacute;s aux r&eacute;gions d&eacute;tect&eacute;es.
</ul>
<li><b>Indicateur 4</b> : Le <b>respect de la forme</b>&nbsp;: Les deux erreurs mesur&eacute;es sont&nbsp;: 
<ul>
<li>L'erreur de forme due &agrave; l'omission de surface des r&eacute;gions.
<li>L'erreur de forme due &agrave; l'ajout de surface aux r&eacute;gions.
</ul>
<li><b>Indicateur 5</b> : La <b>pr&eacute;servation de la topologie</b>&nbsp;: Les deux erreurs mesur&eacute;es sont&nbsp;: 
<ul>
<li>L'erreur d'ajout de trou qui rend compte de la proportion de faux trous d&eacute;tect&eacute;s.
<li>L'erreur de suppression de trou qui rend compte de la proportion de trous non d&eacute;tect&eacute;s.
</ul>
</ul>

<p>Le dossier d'entr&eacute;e est suppos&eacute; contenir autant de sous-dossiers qu'il y a 
d'algorithmes &agrave; classer. De m&ecirc;me, le dossier des segmentations de r&eacute;f&eacute;rence contient
autant de sous-dossiers qu'il a d'expertise pour les images test.
Les sous-dossiers sont tous organis&eacute;s de la m&ecirc;me mani&egrave;re avec les m&ecirc;mes noms d'images.</p>

<p>Pour chaque indicateur <i>i</i>, il est n&eacute;cessaire de pr&eacute;ciser l'erreur qu'il faut consid&eacute;rer comme
la plus acceptable parmi les deux possibles par l'interm&eacute;diaire du param&egrave;tre <i>acceptable_error<sub>i</sub></i>
(voir la section "Param&egrave;tres").</p>

<p>Le r&eacute;sultat est stock&eacute; dans deux collections.
La premi&egrave;re collection <i>col_out1</i> contient les valeurs 
pour les cinq indicateurs de performances ci-dessus.
La deuxi&egrave;me collection <i>col_out2</i> contient les rangs de chacun des algorithmes.</p>

<!---------------------------------- -->
<h3>Param&egrave;tres</h3>
<!---------------------------------- -->
<ul>

<li><i>-v</i> : mode verbeux

<li><i>matching_algorithm_id</i>&nbsp;: sp&eacute;cifie le num&eacute;ro de l'algorithme de mise en correspondance &agrave; utiliser&nbsp;:
<ul>
<li>0&nbsp;: pour une correspondance de type 1-n et n-1. Un segment d'un r&eacute;sultat de segmentation peut regrouper plusieurs
r&eacute;gions de la r&eacute;f&eacute;rence (sous-segmentation),
et une r&eacute;gion de la r&eacute;f&eacute;rence peut &ecirc;tre d&eacute;coup&eacute;e en plusieurs segments
d'un r&eacute;sultat de segmentation (sur-segmentation). 
Toutefois, un segment ou une r&eacute;gion ne peut participer &agrave; la fois &agrave; une sur-segmentation
et &agrave; une sous-segmentation.
<li>1&nbsp;: pour une correspondance de type 1-1. Un segment de la segmentation ne peut &ecirc;tre mis en correspondance qu'avec au plus
une r&eacute;gion de la r&eacute;f&eacute;rence, et une r&eacute;gion de la r&eacute;f&eacute;rence ne peut &ecirc;tre mise en correspondance qu'avec au plus un segment de la segmentation. 
</ul>

<li><i>acceptable_error1</i>, <i>acceptable_error2</i>, <i>acceptable_error3</i>, <i>acceptable_error4</i>, <i>acceptable_error5</i>&nbsp;: permet d'indiquer pour chaque indicateur quelle est l'erreur qu'il faut consid&eacute;rer comme la plus
acceptable. Les valeurs sont comprises entre 1 et 8:
<ol>
<li>Les deux erreurs sont acceptables (pas de p&eacute;nalisation).
<li>Les deux erreurs sont ind&eacute;sirables.
<li>Pr&eacute;f&eacute;rer l'erreur1 &agrave; l'erreur2.
<li>Pr&eacute;f&eacute;rer l'erreur2 &agrave; l'erreur1.
<li>Ne pas p&eacute;naliser l'erreur1.
<li>Ne pas p&eacute;naliser l'erreur2.
<li>Prohiber l'erreur1.
<li>Prohiber l'erreur2.
</ol>

<li><i>priority1</i>, <i>priority2</i>, <i>priority3</i>, <i>priority4</i>, <i>priority5</i>:
La priorit&eacute; relative entre les indicateurs. Plus la priorit&eacute; est faible plus l'importance est grande.
C'est un entier entre 1 et 5 o&ugrave; les ex aequo sont possibles.

<li><i>segmentation_result_path</i>&nbsp;: le chemin vers le dossier des r&eacute;sultats de segmentation de l'algorithme. Ce dossier peut &ecirc;tre organis&eacute; en sous-dossiers.

<li><i>reference_segmentation_path</i>&nbsp;: le chemin vers le dossier des segmentations de r&eacute;f&eacute;rence. Le dossier est divis&eacute; en autant de sous-dossiers qu'il y a d'expertises disponibles sur les images.
Chaque sous-dossier d'expertise est organis&eacute; de la m&ecirc;me fa&ccedil;on qu'un
sous-dossier du dossier <i>segmentation_result_path</i> avec les m&ecirc;mes noms d'image.
</ul>

<!---------------------------------- -->
<h3>Sorties</h3>
<!---------------------------------- -->
<ul>
<li><i>col_out1</i>: une collection contenant les valeurs d'indicateurs pour chaque algorithme.
<li><i>col_out2</i>: une collection contenant les rangs de chaque algorithme.
</ul>

<!---------------------------------- -->
<h3>R&eacute;sultat</h3>
<!---------------------------------- -->
<p>Retourne SUCCESS ou FAILURE en cas de probl&egrave;me.</p>

<!---------------------------------- -->
<h3>Exemples</h3>
<!---------------------------------- -->
<p>Classement des algorithmes &agrave; partir de leurs r&eacute;sultats de segmentation
stock&eacute;s dans des sous-dossiers du dossier 'resultimages'. La priorit&eacute; des indicateurs est dans l'ordre 
la pr&eacute;cision de la d&eacute;tection, la coh&eacute;rence de la fragmentation, le respect de la forme, la pr&eacute;cision de la fronti&egrave;re et la pr&eacute;servation de la topologie&nbsp;:</p>
<pre>
pranksegmentationalgorithmsfromfolders 0 0.5 4 1 5 2 4 4 2 3 1 5 resultimages groundtruths indicators.pan rank.pan
</pre>

<!---------------------------------- -->
<h3>Voir aussi</h3>
<!---------------------------------- -->
<a href="../operatorsP0.html#evaluation">Evaluation</a>,
<a href="./passessdetectionaccuracy.html">passessdetectionaccuracy</a>,
<a href="./passessfragmentationconsistency.html">passessfragmentationconsistency</a>,
<a href="./passessboundaryprecision.html">passessboundaryprecision</a>,
<a href="./passessshapefidelity.html">passessshapefidelity</a>,
<a href="./passesstopologypreservation.html">passesstopologypreservation</a>,
<a href="./passesssegmentationalgorithm.html">passesssegmentationalgorithm</a>,
<a href="./pranksegmentationalgorithms.html">pranksegmentationalgorithms</a>

<!---------------------------------- -->
<h3>Prototype C++</h3>
<!---------------------------------- -->
<tt>
Errc PRankSegmentationAlgorithmsFromFolders( int matching_algorithm_id, float matching_threshold,
					int acceptable_error1, int priority1,
					int acceptable_error2, int priority2,
					int acceptable_error3, int priority3,
					int acceptable_error4, int priority4,
					int acceptable_error5, int priority5,
					std::string segmentation_result_path, std::string ground_truth_path,
					Collection &amp; cold1, Collection &amp; cold2,
					bool verbose );
</tt>

<hr>
<p>
<!---------------------------------- -->
<address>
Auteur: R&eacute;gis Clouard
</address>
<!---------------------------------- -->

</body>
</html>
